## Import libraries

In [39]:
import pandas as pd
import numpy as np
from sklearn.model_selection import train_test_split
from sklearn.naive_bayes import GaussianNB
from sklearn.model_selection import cross_val_score
from sklearn.metrics import classification_report

## Load the dataset, Reconnaissance and Data preparation

In [8]:
df = pd.read_csv('C:/Users/Mehedi Hassan Galib/Desktop/Python/datas/titanic.csv')
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [9]:
df.shape

(891, 12)

In [10]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin'], axis=1, inplace=True)
df.head()

   Pclass     Sex   Age     Fare Embarked  Survived
0       3    male  22.0   7.2500        S         0
1       1  female  38.0  71.2833        C         1
2       3  female  26.0   7.9250        S         1
3       1  female  35.0  53.1000        S         1
4       3    male  35.0   8.0500        S         0

In [11]:
df.isnull().sum()

Pclass        0
Sex           0
Age         177
Fare          0
Embarked      2
Survived      0
dtype: int64

In [14]:
df1 = df.fillna(df.mean())

In [15]:
df1.isnull().sum()

Pclass      0
Sex         0
Age         0
Fare        0
Embarked    2
Survived    0
dtype: int64

In [17]:
df1['Embarked'].fillna(value = 'S', inplace = True)

In [18]:
df1.isnull().sum()

Pclass      0
Sex         0
Age         0
Fare        0
Embarked    0
Survived    0
dtype: int64

In [19]:
df1['Sex'].replace(['female','male'],[0,1], inplace=True)
df1.head()

   Pclass  Sex   Age     Fare Embarked  Survived
0       3    1  22.0   7.2500        S         0
1       1    0  38.0  71.2833        C         1
2       3    0  26.0   7.9250        S         1
3       1    0  35.0  53.1000        S         1
4       3    1  35.0   8.0500        S         0

In [20]:
df1['Embarked'].unique()

array(['S', 'C', 'Q'], dtype=object)

In [22]:
df1['Embarked'].replace(['S', 'C', 'Q'],[0, 1, 2], inplace=True)
df1.head()

   Pclass  Sex   Age     Fare  Embarked  Survived
0       3    1  22.0   7.2500         0         0
1       1    0  38.0  71.2833         1         1
2       3    0  26.0   7.9250         0         1
3       1    0  35.0  53.1000         0         1
4       3    1  35.0   8.0500         0         0

In [23]:
df1.columns

Index(['Pclass', 'Sex', 'Age', 'Fare', 'Embarked', 'Survived'], dtype='object')

In [24]:
X = pd.DataFrame(df1[['Pclass', 'Sex', 'Age', 'Fare', 'Embarked']])
y = df1['Survived']

In [27]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size = 0.2, random_state = 42)

## Naive Bayes Model

In [30]:
nb = GaussianNB()
model = nb.fit(X_train, y_train)

## Prediction using Naive Bayes Model

In [31]:
y_pred = nb.predict(X_test)

In [33]:
df2 = pd.DataFrame(np.c_[y_test, y_pred], columns = ['Actual', 'Predicted'])
df2.head()

   Actual  Predicted
0       1          0
1       0          0
2       0          0
3       1          1
4       1          1

## Model Evaluation

In [36]:
cross_val_score(nb, X, y, cv = 10, scoring = 'accuracy').mean().round(4)

0.7767

In [38]:
nb.score(X_test, y_test)

0.7541899441340782

In [40]:
print(classification_report(y_test, y_pred))

              precision    recall  f1-score   support

           0       0.80      0.78      0.79       105
           1       0.70      0.72      0.71        74

    accuracy                           0.75       179
   macro avg       0.75      0.75      0.75       179
weighted avg       0.76      0.75      0.75       179